apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_wifi_adapter.c
  return (void *)((uintptr_t)pid);
}

/****************************************************************************
 * Name: esp_task_get_max_priority
 *
 * Description:
 *   Get OS task maximum priority
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Task maximum priority
 *
 ****************************************************************************/

static int32_t esp_task_get_max_priority(void)
{
  return SCHED_PRIORITY_MAX;
}

/****************************************************************************
 * Name: esp_malloc
 *
 * Description:
 *   Allocate a block of memory
 *
 * Input Parameters:
 *   size - memory size
 *
 * Returned Value:
 *   Memory pointer
 *
 ****************************************************************************/

static void *esp_malloc(size_t size)
{
  return kmm_malloc(size);
}

/****************************************************************************
 * Name: esp_free
 *
 * Description:
 *   Free a block of memory
 *
 * Input Parameters:
 *   ptr - memory block
 *
 * Returned Value:
 *   No
 *
 ****************************************************************************/

static void esp_free(void *ptr)
{
#ifdef CONFIG_XTENSA_IMEM_USE_SEPARATE_HEAP
  if (xtensa_imm_heapmember(ptr))
    {
      xtensa_imm_free(ptr);
    }
  else
#endif
#ifdef CONFIG_MM_KERNEL_HEAP
  if (kmm_heapmember(ptr))
#endif
    {
      kmm_free(ptr);
    }
#ifdef CONFIG_MM_KERNEL_HEAP
  else
    {
      free(ptr);
    }
#endif
}

#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST

/****************************************************************************
 * Name: semphr_take_from_isr_wrapper
 *
 * Description:
 *   Take a semaphore from an ISR
 *
 * Input Parameters:
 *   semphr - Semaphore data pointer.
 *   hptw   - Unused.
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static int32_t IRAM_ATTR semphr_take_from_isr_wrapper(void *semphr,
                                                      void *hptw)
{
  *(int *)hptw = 0;

  return nuttx_err_to_common_err(nxsem_trywait(semphr));
}

/****************************************************************************
 * Name: semphr_give_from_isr_wrapper
 *
 * Description:
 *   Post semaphore
 *
 * Input Parameters:
 *   semphr - Semaphore data pointer
 *   hptw   - Unused.
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static int32_t IRAM_ATTR semphr_give_from_isr_wrapper(void *semphr,
                                                      void *hptw)
{
  *(int *)hptw = 0;

  return esp_semphr_give(semphr);
}

/****************************************************************************
 * Name: is_in_isr_wrapper
 *
 * Description:
 *   Check current is in interrupt
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   true if in interrupt or false if not
 *
 ****************************************************************************/

static int IRAM_ATTR is_in_isr_wrapper(void)
{
  return up_interrupt_context();
}

#endif /* CONFIG_ESPRESSIF_WIFI_BT_COEXIST */

/****************************************************************************
 * Name: wifi_env_is_chip
 *
 * Description:
 *   Config chip environment
 *
 * Returned Value:
 *   True if on chip or false if on FPGA.
 *
 ****************************************************************************/

static bool wifi_env_is_chip(void)
{
  return true;
}

/****************************************************************************
 * Name: set_intr_wrapper
 *
 * Description:
 *   Route the Wi-Fi interrupt source and attach a handle that uses the HAL
 *   global vector descriptor list. Mark the CPU line as non-IRAM so
 *   esp_intr_noniram_disable() masks it while SPI flash holds the cache off.
 *
 * Input Parameters:
 *     cpu_no      - The CPU which the interrupt number belongs.
 *     intr_source - The interrupt hardware source number.
 *     intr_num    - The interrupt number CPU.
 *     intr_prio   - The interrupt priority.
 *
 * Returned Value:
 *     None
 *
 ****************************************************************************/

static void set_intr_wrapper(int32_t cpu_no, uint32_t intr_source,
                             uint32_t intr_num, int32_t intr_prio)
{
  intr_handle_t handle;
  int irq = ESP_SOURCE2IRQ(intr_source);
  esp_err_t err;

  wlinfo("cpu_no=%" PRId32 ", intr_source=%" PRIu32
         ", intr_num=%" PRIu32 ", intr_prio=%" PRId32 "\n",
         cpu_no, intr_source, intr_num, intr_prio);

  esp_rom_route_intr_matrix(cpu_no, intr_source, intr_num);

  handle = kmm_calloc(1, sizeof(intr_handle_data_t));
  if (handle == NULL)
    {
      wlerr("Failed to kmm_calloc\n");
      return;
    }

  handle->vector_desc = get_desc_for_int(intr_num, cpu_no);
  if (handle->vector_desc == NULL)
    {
      wlerr("get_desc_for_int failed\n");
      kmm_free(handle);
      return;
    }

  handle->vector_desc->source = intr_source;
  handle->shared_vector_desc = NULL;

  /* Register the handle - it contains all needed information (cpuint, cpu) */

  esp_set_handle(cpu_no, irq, handle);

  err = esp_intr_set_in_iram(handle, false);
  if (err != OK)
    {
      wlerr("esp_intr_set_in_iram failed: %d\n", err);
    }
}

/****************************************************************************
 * Name: clear_intr_wrapper
 *
 * Description:
 *   Don't support
 *
 ****************************************************************************/

static void IRAM_ATTR clear_intr_wrapper(uint32_t intr_source,
                                         uint32_t intr_num)
{
}

/****************************************************************************
 * Name: esp_event_post_wrapper
 *
 * Description:
 *   Active work queue and let the work to process the cached event
 *
 * Input Parameters:
 *   event_base      - Event set name
 *   event_id        - Event ID
 *   event_data      - Event private data
 *   event_data_size - Event data size
 *   ticks           - Waiting system ticks
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int32_t esp_event_post_wrapper(const char *event_base,
                                      int32_t event_id,
                                      void *event_data,
                                      size_t event_data_size,
                                      uint32_t ticks_to_wait)
{
  return (int32_t)esp_event_post(event_base,
                                 event_id,
                                 event_data,
                                 event_data_size,
                                 ticks_to_wait);
}

/****************************************************************************
 * Name: esp_get_free_heap_size
 *
 * Description:
 *   Get free heap size by byte
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Free heap size
 *
 ****************************************************************************/

static uint32_t esp_get_free_heap_size(void)
{
  struct mallinfo info;

  info = kmm_mallinfo();
  return info.fordblks;
}

/****************************************************************************
 * Name: esp_dport_access_stall_other_cpu_start
 *
 * Description:
 *   Don't support
 *
 ****************************************************************************/

static void esp_dport_access_stall_other_cpu_start(void)
{
#ifdef CONFIG_SMP
  DEBUGPANIC();
#endif
}

/****************************************************************************
 * Name: esp_dport_access_stall_other_cpu_end
 *
 * Description:
 *   Don't support
 *
 ****************************************************************************/

static void esp_dport_access_stall_other_cpu_end(void)
{
#ifdef CONFIG_SMP
  DEBUGPANIC();
#endif
}

/****************************************************************************
 * Name: wifi_apb80m_request
 *
 * Description:
 *   Take Wi-Fi lock in auto-sleep
 *
 ****************************************************************************/

static void wifi_apb80m_request(void)
{
#ifdef CONFIG_ESP32S3_AUTO_SLEEP
  esp32s3_pm_lockacquire();
#endif
}

/****************************************************************************
 * Name: wifi_apb80m_release
 *
 * Description:
 *   Release Wi-Fi lock in auto-sleep
 *
 ****************************************************************************/

