apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_wifi_adapter.c
static uint8_t coex_schm_curr_period_get_wrapper(void)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_curr_period_get();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_curr_phase_get_wrapper
 *
 * Description:
 *   Get current coexistence scheme phase.
 *
 * Input Parameters:
 *   none
 *
 * Returned Value:
 *   Coexistence scheme phase
 *
 ****************************************************************************/

static void *coex_schm_curr_phase_get_wrapper(void)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_curr_phase_get();
#else
  return NULL;
#endif
}

/****************************************************************************
 * Name: coex_register_start_cb_wrapper
 *
 * Description:
 *   Register Wi-Fi callback for coexistence starts.
 *
 * Input Parameters:
 *   cb - WiFi callback
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

static int coex_register_start_cb_wrapper(int (* cb)(void))
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_register_start_cb(cb);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_process_restart_wrapper
 *
 * Description:
 *   Restart current coexistence scheme.
 *
 * Input Parameters:
 *   none
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

static int coex_schm_process_restart_wrapper(void)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_process_restart();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_register_cb_wrapper
 *
 * Description:
 *   Register callback for coexistence scheme.
 *
 * Input Parameters:
 *   type     - callback type
 *   callback - callback
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

static int coex_schm_register_cb_wrapper(int type, int(*cb)(int))
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_register_callback(type, cb);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_flexible_period_set_wrapper
 *
 * Description:
 *   This is a wrapper for coex_schm_flexible_period_set. It sets the
 *   flexible period for the coexistence mechanism. If power management
 *   feature is enabled (CONFIG_ESP_COEX_POWER_MANAGEMENT), it calls the
 *   function with the given period. If the feature is not enabled, it
 *   returns 0.
 *
 * Input Parameters:
 *   period - The period to set for the coexistence mechanism.
 *
 * Returned Value:
 *   If power management is enabled, it returns the result of the
 *   coex_schm_flexible_period_set function. Otherwise, it returns 0.
 *
 ****************************************************************************/

static int coex_schm_flexible_period_set_wrapper(uint8_t period)
{
#if CONFIG_ESP_COEX_POWER_MANAGEMENT
  return coex_schm_flexible_period_set(period);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_flexible_period_get_wrapper
 *
 * Description:
 *   This is a wrapper for coex_schm_flexible_period_get. If power management
 *   feature is enabled (CONFIG_ESP_COEX_POWER_MANAGEMENT), it calls the
 *   function and returns its result. If the feature is not enabled, it
 *   returns 1.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   If power management is enabled, it returns the result of the
 *   coex_schm_flexible_period_get function. Otherwise, it returns 1.
 *
 ****************************************************************************/

static uint8_t coex_schm_flexible_period_get_wrapper(void)
{
#if CONFIG_ESP_COEX_POWER_MANAGEMENT
  return coex_schm_flexible_period_get();
#else
  return 1;
#endif
}

/****************************************************************************
 * Name: coex_schm_get_phase_by_idx_wrapper
 *
 * Description:
 *   This is a wrapper for coex_schm_get_phase_by_idx. If software
 *   coexistence is enabled (CONFIG_SW_COEXIST_ENABLE), it calls the function
 *   to get the coexistence phase by index. If software coexistence is not
 *   enabled, it returns NULL.
 *
 * Input Parameters:
 *   phase_idx - Index of the coexistence phase to retrieve
 *
 * Returned Value:
 *   If software coexistence is enabled, returns pointer to the coexistence
 *   phase. Otherwise returns NULL.
 *
 ****************************************************************************/

static void * coex_schm_get_phase_by_idx_wrapper(int phase_idx)
{
#if CONFIG_SW_COEXIST_ENABLE
  return coex_schm_get_phase_by_idx(phase_idx);
#else
  return NULL;
#endif
}

/****************************************************************************
 * Name: esp_random_ulong
 *
 * Description:
 *   Get random value and convert to unsigned long.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Random value
 *
 ****************************************************************************/

static unsigned long esp_random_ulong(void)
{
  return esp_random();
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_wifi_bt_coexist_init
 *
 * Description:
 *   Initialize ESP32-S3 Wi-Fi and BT coexistence module.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success (positive non-zero values are cmd-specific)
 *   Negated errno returned on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
int esp_wifi_bt_coexist_init(void)
{
  esp_coex_adapter_register(&g_coex_adapter_funcs);
  coex_pre_init();

  return 0;
}
#endif /* CONFIG_ESPRESSIF_WIFI_BT_COEXIST */
